MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAS169/mcu.h
extern volatile __BF1DEVCFG1bits_t BF1DEVCFG1bits __asm__ ("BF1DEVCFG1") __attribute__((section("sfrs"), address(0xBFC4FFC8)));
#define BF1DEVCFG0 BF1DEVCFG0
extern volatile uint32_t   BF1DEVCFG0 __attribute__((section("sfrs"), address(0xBFC4FFCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCTYPE:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t :24;
    uint32_t POSCAGCDLY:2;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCFG0bits_t;
extern volatile __BF1DEVCFG0bits_t BF1DEVCFG0bits __asm__ ("BF1DEVCFG0") __attribute__((section("sfrs"), address(0xBFC4FFCC)));
#define BF1DEVCP3 BF1DEVCP3
extern volatile uint32_t   BF1DEVCP3 __attribute__((section("sfrs"), address(0xBFC4FFD0)));
#define BF1DEVCP2 BF1DEVCP2
extern volatile uint32_t   BF1DEVCP2 __attribute__((section("sfrs"), address(0xBFC4FFD4)));
#define BF1DEVCP1 BF1DEVCP1
extern volatile uint32_t   BF1DEVCP1 __attribute__((section("sfrs"), address(0xBFC4FFD8)));
#define BF1DEVCP0 BF1DEVCP0
extern volatile uint32_t   BF1DEVCP0 __attribute__((section("sfrs"), address(0xBFC4FFDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __BF1DEVCP0bits_t;
extern volatile __BF1DEVCP0bits_t BF1DEVCP0bits __asm__ ("BF1DEVCP0") __attribute__((section("sfrs"), address(0xBFC4FFDC)));
#define BF1DEVSIGN3 BF1DEVSIGN3
extern volatile uint32_t   BF1DEVSIGN3 __attribute__((section("sfrs"), address(0xBFC4FFE0)));
#define BF1DEVSIGN2 BF1DEVSIGN2
extern volatile uint32_t   BF1DEVSIGN2 __attribute__((section("sfrs"), address(0xBFC4FFE4)));
#define BF1DEVSIGN1 BF1DEVSIGN1
extern volatile uint32_t   BF1DEVSIGN1 __attribute__((section("sfrs"), address(0xBFC4FFE8)));
#define BF1DEVSIGN0 BF1DEVSIGN0
extern volatile uint32_t   BF1DEVSIGN0 __attribute__((section("sfrs"), address(0xBFC4FFEC)));
#define BF1SEQ3 BF1SEQ3
extern volatile uint32_t   BF1SEQ3 __attribute__((section("sfrs"), address(0xBFC4FFF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __BF1SEQ3bits_t;
extern volatile __BF1SEQ3bits_t BF1SEQ3bits __asm__ ("BF1SEQ3") __attribute__((section("sfrs"), address(0xBFC4FFF0)));
#define BF1SEQ2 BF1SEQ2
extern volatile uint32_t   BF1SEQ2 __attribute__((section("sfrs"), address(0xBFC4FFF4)));
#define BF1SEQ1 BF1SEQ1
extern volatile uint32_t   BF1SEQ1 __attribute__((section("sfrs"), address(0xBFC4FFF8)));
#define BF1SEQ0 BF1SEQ0
extern volatile uint32_t   BF1SEQ0 __attribute__((section("sfrs"), address(0xBFC4FFFC)));
#define ABF2DEVCFG4 ABF2DEVCFG4
extern volatile uint32_t   ABF2DEVCFG4 __attribute__((section("sfrs"), address(0xBFC6FF3C)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t SWDTPS:5;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG4bits_t;
extern volatile __ABF2DEVCFG4bits_t ABF2DEVCFG4bits __asm__ ("ABF2DEVCFG4") __attribute__((section("sfrs"), address(0xBFC6FF3C)));
#define ABF2DEVCFG3 ABF2DEVCFG3
extern volatile uint32_t   ABF2DEVCFG3 __attribute__((section("sfrs"), address(0xBFC6FF40)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :8;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG3bits_t;
extern volatile __ABF2DEVCFG3bits_t ABF2DEVCFG3bits __asm__ ("ABF2DEVCFG3") __attribute__((section("sfrs"), address(0xBFC6FF40)));
#define ABF2DEVCFG2 ABF2DEVCFG2
extern volatile uint32_t   ABF2DEVCFG2 __attribute__((section("sfrs"), address(0xBFC6FF44)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t VBATBOREN:1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t :1;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG2bits_t;
extern volatile __ABF2DEVCFG2bits_t ABF2DEVCFG2bits __asm__ ("ABF2DEVCFG2") __attribute__((section("sfrs"), address(0xBFC6FF44)));
#define ABF2DEVCFG1 ABF2DEVCFG1
extern volatile uint32_t   ABF2DEVCFG1 __attribute__((section("sfrs"), address(0xBFC6FF48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG1bits_t;
extern volatile __ABF2DEVCFG1bits_t ABF2DEVCFG1bits __asm__ ("ABF2DEVCFG1") __attribute__((section("sfrs"), address(0xBFC6FF48)));
#define ABF2DEVCFG0 ABF2DEVCFG0
extern volatile uint32_t   ABF2DEVCFG0 __attribute__((section("sfrs"), address(0xBFC6FF4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCTYPE:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t :24;
    uint32_t POSCAGCDLY:2;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __ABF2DEVCFG0bits_t;
