MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAS169/mcu.h
#define _GLCDCURDATA68_PIXEL172_POSITION         0x00000014
#define _GLCDCURDATA68_PIXEL172_MASK             0x00F00000
#define _GLCDCURDATA68_PIXEL172_LENGTH           0x00000004

#define _GLCDCURDATA68_PIXEL171_POSITION         0x00000018
#define _GLCDCURDATA68_PIXEL171_MASK             0x0F000000
#define _GLCDCURDATA68_PIXEL171_LENGTH           0x00000004

#define _GLCDCURDATA68_PIXEL170_POSITION         0x0000001C
#define _GLCDCURDATA68_PIXEL170_MASK             0xF0000000
#define _GLCDCURDATA68_PIXEL170_LENGTH           0x00000004

#define _GLCDCURDATA69_PIXEL1715_POSITION        0x00000000
#define _GLCDCURDATA69_PIXEL1715_MASK            0x0000000F
#define _GLCDCURDATA69_PIXEL1715_LENGTH          0x00000004

#define _GLCDCURDATA69_PIXEL1714_POSITION        0x00000004
#define _GLCDCURDATA69_PIXEL1714_MASK            0x000000F0
#define _GLCDCURDATA69_PIXEL1714_LENGTH          0x00000004

#define _GLCDCURDATA69_PIXEL1713_POSITION        0x00000008
#define _GLCDCURDATA69_PIXEL1713_MASK            0x00000F00
#define _GLCDCURDATA69_PIXEL1713_LENGTH          0x00000004

#define _GLCDCURDATA69_PIXEL1712_POSITION        0x0000000C
#define _GLCDCURDATA69_PIXEL1712_MASK            0x0000F000
#define _GLCDCURDATA69_PIXEL1712_LENGTH          0x00000004

#define _GLCDCURDATA69_PIXEL1711_POSITION        0x00000010
#define _GLCDCURDATA69_PIXEL1711_MASK            0x000F0000
#define _GLCDCURDATA69_PIXEL1711_LENGTH          0x00000004

#define _GLCDCURDATA69_PIXEL1710_POSITION        0x00000014
#define _GLCDCURDATA69_PIXEL1710_MASK            0x00F00000
#define _GLCDCURDATA69_PIXEL1710_LENGTH          0x00000004

#define _GLCDCURDATA69_PIXEL179_POSITION         0x00000018
#define _GLCDCURDATA69_PIXEL179_MASK             0x0F000000
#define _GLCDCURDATA69_PIXEL179_LENGTH           0x00000004

#define _GLCDCURDATA69_PIXEL178_POSITION         0x0000001C
#define _GLCDCURDATA69_PIXEL178_MASK             0xF0000000
#define _GLCDCURDATA69_PIXEL178_LENGTH           0x00000004

#define _GLCDCURDATA70_PIXEL1723_POSITION        0x00000000
#define _GLCDCURDATA70_PIXEL1723_MASK            0x0000000F
#define _GLCDCURDATA70_PIXEL1723_LENGTH          0x00000004

#define _GLCDCURDATA70_PIXEL1722_POSITION        0x00000004
#define _GLCDCURDATA70_PIXEL1722_MASK            0x000000F0
#define _GLCDCURDATA70_PIXEL1722_LENGTH          0x00000004

#define _GLCDCURDATA70_PIXEL1721_POSITION        0x00000008
#define _GLCDCURDATA70_PIXEL1721_MASK            0x00000F00
#define _GLCDCURDATA70_PIXEL1721_LENGTH          0x00000004

#define _GLCDCURDATA70_PIXEL1720_POSITION        0x0000000C
#define _GLCDCURDATA70_PIXEL1720_MASK            0x0000F000
#define _GLCDCURDATA70_PIXEL1720_LENGTH          0x00000004

#define _GLCDCURDATA70_PIXEL1719_POSITION        0x00000010
#define _GLCDCURDATA70_PIXEL1719_MASK            0x000F0000
#define _GLCDCURDATA70_PIXEL1719_LENGTH          0x00000004

#define _GLCDCURDATA70_PIXEL1718_POSITION        0x00000014
#define _GLCDCURDATA70_PIXEL1718_MASK            0x00F00000
#define _GLCDCURDATA70_PIXEL1718_LENGTH          0x00000004

#define _GLCDCURDATA70_PIXEL1717_POSITION        0x00000018
#define _GLCDCURDATA70_PIXEL1717_MASK            0x0F000000
#define _GLCDCURDATA70_PIXEL1717_LENGTH          0x00000004

#define _GLCDCURDATA70_PIXEL1716_POSITION        0x0000001C
#define _GLCDCURDATA70_PIXEL1716_MASK            0xF0000000
#define _GLCDCURDATA70_PIXEL1716_LENGTH          0x00000004

#define _GLCDCURDATA71_PIXEL1731_POSITION        0x00000000
#define _GLCDCURDATA71_PIXEL1731_MASK            0x0000000F
#define _GLCDCURDATA71_PIXEL1731_LENGTH          0x00000004

#define _GLCDCURDATA71_PIXEL1730_POSITION        0x00000004
#define _GLCDCURDATA71_PIXEL1730_MASK            0x000000F0
#define _GLCDCURDATA71_PIXEL1730_LENGTH          0x00000004

#define _GLCDCURDATA71_PIXEL1729_POSITION        0x00000008
#define _GLCDCURDATA71_PIXEL1729_MASK            0x00000F00
#define _GLCDCURDATA71_PIXEL1729_LENGTH          0x00000004

#define _GLCDCURDATA71_PIXEL1728_POSITION        0x0000000C
#define _GLCDCURDATA71_PIXEL1728_MASK            0x0000F000
#define _GLCDCURDATA71_PIXEL1728_LENGTH          0x00000004

#define _GLCDCURDATA71_PIXEL1727_POSITION        0x00000010
#define _GLCDCURDATA71_PIXEL1727_MASK            0x000F0000
#define _GLCDCURDATA71_PIXEL1727_LENGTH          0x00000004

#define _GLCDCURDATA71_PIXEL1726_POSITION        0x00000014
#define _GLCDCURDATA71_PIXEL1726_MASK            0x00F00000
#define _GLCDCURDATA71_PIXEL1726_LENGTH          0x00000004

#define _GLCDCURDATA71_PIXEL1725_POSITION        0x00000018
#define _GLCDCURDATA71_PIXEL1725_MASK            0x0F000000
#define _GLCDCURDATA71_PIXEL1725_LENGTH          0x00000004

#define _GLCDCURDATA71_PIXEL1724_POSITION        0x0000001C
#define _GLCDCURDATA71_PIXEL1724_MASK            0xF0000000
#define _GLCDCURDATA71_PIXEL1724_LENGTH          0x00000004

#define _GLCDCURDATA72_PIXEL187_POSITION         0x00000000
#define _GLCDCURDATA72_PIXEL187_MASK             0x0000000F
#define _GLCDCURDATA72_PIXEL187_LENGTH           0x00000004

#define _GLCDCURDATA72_PIXEL186_POSITION         0x00000004
#define _GLCDCURDATA72_PIXEL186_MASK             0x000000F0
#define _GLCDCURDATA72_PIXEL186_LENGTH           0x00000004

#define _GLCDCURDATA72_PIXEL185_POSITION         0x00000008
#define _GLCDCURDATA72_PIXEL185_MASK             0x00000F00
#define _GLCDCURDATA72_PIXEL185_LENGTH           0x00000004

#define _GLCDCURDATA72_PIXEL184_POSITION         0x0000000C
#define _GLCDCURDATA72_PIXEL184_MASK             0x0000F000
#define _GLCDCURDATA72_PIXEL184_LENGTH           0x00000004

#define _GLCDCURDATA72_PIXEL183_POSITION         0x00000010
#define _GLCDCURDATA72_PIXEL183_MASK             0x000F0000
#define _GLCDCURDATA72_PIXEL183_LENGTH           0x00000004

#define _GLCDCURDATA72_PIXEL182_POSITION         0x00000014
#define _GLCDCURDATA72_PIXEL182_MASK             0x00F00000
#define _GLCDCURDATA72_PIXEL182_LENGTH           0x00000004

#define _GLCDCURDATA72_PIXEL181_POSITION         0x00000018
#define _GLCDCURDATA72_PIXEL181_MASK             0x0F000000
#define _GLCDCURDATA72_PIXEL181_LENGTH           0x00000004

